"use strict";
import { QueryInterface, DataTypes } from "sequelize";

/** @type {import('sequelize-cli').Migration} */

export const up = async ({ context: queryInterface }) => {
  await queryInterface.sequelize.query(`
TRUNCATE technique CASCADE;

INSERT INTO technique (name, slug, description, tags, symptoms, settings, icon, color, "sortBy",audio, "createdAt", "updatedAt" )
VALUES
    (
        'Квадратное дыхание',
        'focus',
        'Базовая техника для стабилизации. Использовать при умеренном стрессе, потере концентрации, сумбуре в мыслях или легком волнении. Помогает вернуть контроль над ситуацией.',
        ARRAY['focus','balance','neutral','clarity','баланс','фокус','стабильность'],
        ARRAY['расфокус','туман в голове','суета','прокрастинация','рабочее напряжение','мандраж','тревога'],
        '[{ "inhale": 4, "holdIn": 4, "exhale": 4, "holdOut": 4, "rounds": 18 }]',
        '🎯',
        'from-indigo-400 to-purple-500',
        1,
        '{ "instructionUrl": "/audio/voice/focus_inhale.mp3", "backgroundUrl": "/audio/bg/deep_focus.mp3" }',
        NOW(),
        NOW()
    ),
    (
        '4-7-8',
        'calm',
        'Сильное седативное воздействие. Использовать при острых состояниях: паника, физическая дрожь, сильная тревога, бессонница, гнев или страх. Работает через активацию блуждающего нерва.',
        ARRAY['panic','anxiety','tremor','insomnia','vagus','успокоение','сон','торможение'],
        ARRAY['дрожь','тремор','паника','сердцебиение','ярость','злость','страх','бессонница','перевозбуждение','много энергии'],
        '[{ "inhale": 4, "holdIn": 0, "exhale": 7, "holdOut": 8, "rounds": 15 }]',
        '😌',
        'from-rose-400 to-pink-500',
        2,
        '{ "instructionUrl": "/audio/voice/calm_inhale.mp3", "backgroundUrl": "/audio/bg/deep_relax.mp3" }',
        NOW(),
        NOW()
    ),
    (
     'Бодрящее дыхание',
        'energy',
        'Активирующая техника. Использовать при апатии, сонливости, упадке сил, заторможенности или когда нужно быстро проснуться. Повышает частоту сердечных сокращений.',
        ARRAY['energy','alert','fatigue','wakeup','power','энергия','тонус', 'активация'],
        ARRAY['апатия', 'сонливость', 'упадок сил', 'заторможенность'],
        '[{ "inhale": 2, "holdIn": 0, "exhale": 2, "holdOut": 0, "rounds": 35 }]',
        '⚡',
        'from-amber-400 to-orange-500',
        3,
        '{ "instructionUrl": "/audio/voice/energy_inhale.mp3", "backgroundUrl": "/audio/bg/deep_energy.mp3" }',
        NOW(),
        NOW()
    );

      `);
};

export const down = async () => {
  // Нет отката для заполнения таблицы
};
